rails/app/controllers/places_controller.rb

  def create
    @place = Place.new(place_params)

    respond_to do |format|
      if @place.save
---
INSERT INTO "places" ("name", "type_of_place", "created_at", "updated_at", "lat", "long", "region") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @place.update(place_params)
---
UPDATE "places" SET "name" = $1, "updated_at" = $2 WHERE "places"."id" = $3  [["name", "New name"], ["updated_at", "2020-04-23 21:19:03.471774"], ["id", 9]]

  def destroy
    @place.destroy
---
DELETE FROM "places" WHERE "places"."id" = $1  [["id", 11]]

    def set_place
      @place = Place.find(params[:id])
---
SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]