rails/app/controllers/speakers_controller.rb

SELECT  "speakers".* FROM "speakers" WHERE "speakers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @speaker = Speaker.find_by(id: params[:id]) || Speaker.new

SELECT  "speakers".* FROM "speakers" WHERE "speakers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @speaker = Speaker.find_by(id: params[:id])

INSERT INTO "speakers" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Jon Snow"], ["created_at", "2020-04-23 21:19:04.023900"], ["updated_at", "2020-04-23 21:19:04.023900"]]
---
  def create
    @speaker = Speaker.create(speaker_params)

SELECT  "speakers".* FROM "speakers" WHERE "speakers"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "speakers" SET "name" = $1, "updated_at" = $2 WHERE "speakers"."id" = $3  [["name", "New Name"], ["updated_at", "2020-04-23 21:19:04.088054"], ["id", 9]]
---
  def update
    @speaker = Speaker.find_by(id: params[:id])
    @speaker.update_attributes(speaker_params)